## 관계형 데이터 베이스 특징

#고유 식별자

- 테이블은 각 행을 식별하기 위하여 고유 식별자를 정의할 수 있음

- 고유 식별자는 NOT NULL UNIQUE 속성을 갖음

- 고유 식별자는 하나 또는 여러 개의 컬럼들로 정의할 수 있음

- #참조 무결성

 - 테이블에서 외래 키를 선언

 - 외래래 키는 다른 테이블에 정의된 고유 식별자를 참조
 
 - 외래 키의 값은 다른 테이블에 정의된 고유 식별자의 값의 범위를 넘을 수 없도록 제한됨
 
 - 참조 무결성 : 참조하는 칼럼들은 반드시 자신이 참조하는 칼럼에 갔을 때 그 값이 존재해야한다. 1:N 관계에서 중요한 역할
 
# RDBMS 
  
 - 관계형 데이터베이스를 생성하고 수정하고 관리할 수 있는 소프트웨어 
 
# 테이블 속성
 !(http://www.tcpschool.com/lectures/img_mysql_table.png)

# 주 식별자(Primary Key)

 - 하나의 레코드를 고유하게 구분할 수 있는 것으로 하나의 컬럼 또는 여러 개의 컬럼이 모여 Primary Key를 구성
 
 - 여러 개의 컬럼이 모여 Primary Key를 구성
 
 - Not Null & Unique
 
 - Primary Key는 테이블 등록 시 명시해 주어야 함
 
 - 만일 ID가 Primary Key로 선언되지 않았으면 번호들이 중복으로 들어가는 것이 허용됨
 
 - ID가 Primary Key로 선언되면 중복된 값을 넣으려고 할 때 거부되며 오류가 발생
 
 - 후보 식별자의 경우 NULL을 허용한다.
 
 # 앞으로 해당 정리하면서 공부할 내용
 
 # 학생 수강신청 관리 고려사항
 
 - **테이블 변경 시**
  
  - 만일 같은 과목을 담당하는 선생님들이 두명 이상으로 늘어날 경우 대처방법
  
  - **데이터 오류 시**
  
   - 과목명을 오기했을 경우 대처 방법
   
   - 학생명을 오기했을 경우 대처방법
   
   - 한 학생이 동일한 과목을 두번 이상 수강신청 한 경우 대처방법
   
   - 한 과목도 신청하지 않은 학생을 찾아내는 방법
   
   - 동명 이인이 존재하는 경우 해결 방법
   
   - 한 과목이 폐강되었을 때 대처 방법 
   
